results/baseline/case-2/forte/catalog/run-01/k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/load/catalog-ramp.js
        output: -

     scenarios: (100.00%) 1 scenario, 90 max VUs, 3m15s max duration (incl. graceful stop):
              * ramp_load: Up to 90 looping VUs for 3m10s over 3 stages (gracefulRampDown: 5s, gracefulStop: 30s)


running (0m01.0s), 11/90 VUs, 60 complete and 0 interrupted iterations
ramp_load   [   1% ] 11/90 VUs  0m01.0s/3m10.0s

running (0m02.0s), 13/90 VUs, 138 complete and 0 interrupted iterations
ramp_load   [   1% ] 13/90 VUs  0m02.0s/3m10.0s

running (0m03.0s), 15/90 VUs, 248 complete and 0 interrupted iterations
ramp_load   [   2% ] 15/90 VUs  0m03.0s/3m10.0s

running (0m04.0s), 17/90 VUs, 363 complete and 0 interrupted iterations
ramp_load   [   2% ] 17/90 VUs  0m04.0s/3m10.0s

running (0m05.0s), 19/90 VUs, 465 complete and 0 interrupted iterations
ramp_load   [   3% ] 19/90 VUs  0m05.0s/3m10.0s

running (0m06.0s), 21/90 VUs, 595 complete and 0 interrupted iterations
ramp_load   [   3% ] 21/90 VUs  0m06.0s/3m10.0s

running (0m07.0s), 23/90 VUs, 732 complete and 0 interrupted iterations
ramp_load   [   4% ] 23/90 VUs  0m07.0s/3m10.0s

running (0m08.0s), 25/90 VUs, 864 complete and 0 interrupted iterations
ramp_load   [   4% ] 25/90 VUs  0m08.0s/3m10.0s

running (0m09.0s), 27/90 VUs, 999 complete and 0 interrupted iterations
ramp_load   [   5% ] 27/90 VUs  0m09.0s/3m10.0s

running (0m10.0s), 29/90 VUs, 1138 complete and 0 interrupted iterations
ramp_load   [   5% ] 29/90 VUs  0m10.0s/3m10.0s

running (0m11.0s), 31/90 VUs, 1282 complete and 0 interrupted iterations
ramp_load   [   6% ] 31/90 VUs  0m11.0s/3m10.0s

running (0m12.0s), 33/90 VUs, 1430 complete and 0 interrupted iterations
ramp_load   [   6% ] 33/90 VUs  0m12.0s/3m10.0s

running (0m13.0s), 35/90 VUs, 1573 complete and 0 interrupted iterations
ramp_load   [   7% ] 35/90 VUs  0m13.0s/3m10.0s

running (0m14.0s), 37/90 VUs, 1732 complete and 0 interrupted iterations
ramp_load   [   7% ] 37/90 VUs  0m14.0s/3m10.0s

running (0m15.0s), 39/90 VUs, 1885 complete and 0 interrupted iterations
ramp_load   [   8% ] 39/90 VUs  0m15.0s/3m10.0s

running (0m16.0s), 41/90 VUs, 1999 complete and 0 interrupted iterations
ramp_load   [   8% ] 41/90 VUs  0m16.0s/3m10.0s

running (0m17.0s), 43/90 VUs, 2068 complete and 0 interrupted iterations
ramp_load   [   9% ] 43/90 VUs  0m17.0s/3m10.0s

running (0m18.0s), 45/90 VUs, 2164 complete and 0 interrupted iterations
ramp_load   [   9% ] 45/90 VUs  0m18.0s/3m10.0s

running (0m19.0s), 47/90 VUs, 2265 complete and 0 interrupted iterations
ramp_load   [  10% ] 47/90 VUs  0m19.0s/3m10.0s

running (0m20.0s), 49/90 VUs, 2389 complete and 0 interrupted iterations
ramp_load   [  11% ] 49/90 VUs  0m20.0s/3m10.0s

running (0m21.0s), 51/90 VUs, 2500 complete and 0 interrupted iterations
ramp_load   [  11% ] 51/90 VUs  0m21.0s/3m10.0s

running (0m22.0s), 53/90 VUs, 2652 complete and 0 interrupted iterations
ramp_load   [  12% ] 53/90 VUs  0m22.0s/3m10.0s

running (0m23.0s), 55/90 VUs, 2803 complete and 0 interrupted iterations
ramp_load   [  12% ] 55/90 VUs  0m23.0s/3m10.0s

running (0m24.0s), 57/90 VUs, 2945 complete and 0 interrupted iterations
ramp_load   [  13% ] 57/90 VUs  0m24.0s/3m10.0s

running (0m25.0s), 59/90 VUs, 3094 complete and 0 interrupted iterations
ramp_load   [  13% ] 59/90 VUs  0m25.0s/3m10.0s

running (0m26.0s), 61/90 VUs, 3248 complete and 0 interrupted iterations
ramp_load   [  14% ] 61/90 VUs  0m26.0s/3m10.0s

running (0m27.0s), 63/90 VUs, 3406 complete and 0 interrupted iterations
ramp_load   [  14% ] 63/90 VUs  0m27.0s/3m10.0s

running (0m28.0s), 65/90 VUs, 3557 complete and 0 interrupted iterations
ramp_load   [  15% ] 65/90 VUs  0m28.0s/3m10.0s

running (0m29.0s), 67/90 VUs, 3708 complete and 0 interrupted iterations
ramp_load   [  15% ] 67/90 VUs  0m29.0s/3m10.0s

running (0m30.0s), 69/90 VUs, 3863 complete and 0 interrupted iterations
ramp_load   [  16% ] 69/90 VUs  0m30.0s/3m10.0s

running (0m31.0s), 71/90 VUs, 4013 complete and 0 interrupted iterations
ramp_load   [  16% ] 71/90 VUs  0m31.0s/3m10.0s

running (0m32.0s), 73/90 VUs, 4165 complete and 0 interrupted iterations
ramp_load   [  17% ] 73/90 VUs  0m32.0s/3m10.0s

running (0m33.0s), 75/90 VUs, 4327 complete and 0 interrupted iterations
ramp_load   [  17% ] 75/90 VUs  0m33.0s/3m10.0s

running (0m34.0s), 77/90 VUs, 4484 complete and 0 interrupted iterations
ramp_load   [  18% ] 77/90 VUs  0m34.0s/3m10.0s

running (0m35.0s), 79/90 VUs, 4640 complete and 0 interrupted iterations
ramp_load   [  18% ] 79/90 VUs  0m35.0s/3m10.0s

running (0m36.0s), 81/90 VUs, 4779 complete and 0 interrupted iterations
ramp_load   [  19% ] 81/90 VUs  0m36.0s/3m10.0s

running (0m37.0s), 83/90 VUs, 4886 complete and 0 interrupted iterations
ramp_load   [  19% ] 83/90 VUs  0m37.0s/3m10.0s

running (0m38.0s), 85/90 VUs, 5008 complete and 0 interrupted iterations
ramp_load   [  20% ] 85/90 VUs  0m38.0s/3m10.0s

running (0m39.0s), 87/90 VUs, 5122 complete and 0 interrupted iterations
ramp_load   [  21% ] 87/90 VUs  0m39.0s/3m10.0s

running (0m40.0s), 89/90 VUs, 5263 complete and 0 interrupted iterations
ramp_load   [  21% ] 89/90 VUs  0m40.0s/3m10.0s

running (0m41.0s), 90/90 VUs, 5407 complete and 0 interrupted iterations
ramp_load   [  22% ] 90/90 VUs  0m41.0s/3m10.0s

running (0m42.0s), 90/90 VUs, 5569 complete and 0 interrupted iterations
ramp_load   [  22% ] 90/90 VUs  0m42.0s/3m10.0s

running (0m43.0s), 90/90 VUs, 5664 complete and 0 interrupted iterations
ramp_load   [  23% ] 90/90 VUs  0m43.0s/3m10.0s

running (0m44.0s), 90/90 VUs, 5783 complete and 0 interrupted iterations
ramp_load   [  23% ] 90/90 VUs  0m44.0s/3m10.0s

running (0m45.0s), 90/90 VUs, 5908 complete and 0 interrupted iterations
ramp_load   [  24% ] 90/90 VUs  0m45.0s/3m10.0s

running (0m46.0s), 90/90 VUs, 6067 complete and 0 interrupted iterations
ramp_load   [  24% ] 90/90 VUs  0m46.0s/3m10.0s

running (0m47.0s), 90/90 VUs, 6196 complete and 0 interrupted iterations
ramp_load   [  25% ] 90/90 VUs  0m47.0s/3m10.0s

running (0m48.0s), 90/90 VUs, 6333 complete and 0 interrupted iterations
ramp_load   [  25% ] 90/90 VUs  0m48.0s/3m10.0s

running (0m49.0s), 90/90 VUs, 6496 complete and 0 interrupted iterations
ramp_load   [  26% ] 90/90 VUs  0m49.0s/3m10.0s

running (0m50.0s), 90/90 VUs, 6632 complete and 0 interrupted iterations
ramp_load   [  26% ] 90/90 VUs  0m50.0s/3m10.0s

running (0m51.0s), 90/90 VUs, 6778 complete and 0 interrupted iterations
ramp_load   [  27% ] 90/90 VUs  0m51.0s/3m10.0s

running (0m52.0s), 90/90 VUs, 6917 complete and 0 interrupted iterations
ramp_load   [  27% ] 90/90 VUs  0m52.0s/3m10.0s

running (0m53.0s), 90/90 VUs, 7072 complete and 0 interrupted iterations
ramp_load   [  28% ] 90/90 VUs  0m53.0s/3m10.0s

running (0m54.0s), 90/90 VUs, 7226 complete and 0 interrupted iterations
ramp_load   [  28% ] 90/90 VUs  0m54.0s/3m10.0s

running (0m55.0s), 90/90 VUs, 7344 complete and 0 interrupted iterations
ramp_load   [  29% ] 90/90 VUs  0m55.0s/3m10.0s

running (0m56.0s), 90/90 VUs, 7501 complete and 0 interrupted iterations
ramp_load   [  29% ] 90/90 VUs  0m56.0s/3m10.0s

running (0m57.0s), 90/90 VUs, 7661 complete and 0 interrupted iterations
ramp_load   [  30% ] 90/90 VUs  0m57.0s/3m10.0s

running (0m58.0s), 90/90 VUs, 7781 complete and 0 interrupted iterations
ramp_load   [  31% ] 90/90 VUs  0m58.0s/3m10.0s

running (0m59.0s), 90/90 VUs, 7909 complete and 0 interrupted iterations
ramp_load   [  31% ] 90/90 VUs  0m59.0s/3m10.0s

running (1m00.0s), 90/90 VUs, 8065 complete and 0 interrupted iterations
ramp_load   [  32% ] 90/90 VUs  1m00.0s/3m10.0s

running (1m01.0s), 90/90 VUs, 8237 complete and 0 interrupted iterations
ramp_load   [  32% ] 90/90 VUs  1m01.0s/3m10.0s

running (1m02.0s), 90/90 VUs, 8418 complete and 0 interrupted iterations
ramp_load   [  33% ] 90/90 VUs  1m02.0s/3m10.0s

running (1m03.0s), 90/90 VUs, 8579 complete and 0 interrupted iterations
ramp_load   [  33% ] 90/90 VUs  1m03.0s/3m10.0s

running (1m04.0s), 90/90 VUs, 8713 complete and 0 interrupted iterations
ramp_load   [  34% ] 90/90 VUs  1m04.0s/3m10.0s

running (1m05.0s), 90/90 VUs, 8876 complete and 0 interrupted iterations
ramp_load   [  34% ] 90/90 VUs  1m05.0s/3m10.0s

running (1m06.0s), 90/90 VUs, 9036 complete and 0 interrupted iterations
ramp_load   [  35% ] 90/90 VUs  1m06.0s/3m10.0s

running (1m07.0s), 90/90 VUs, 9170 complete and 0 interrupted iterations
ramp_load   [  35% ] 90/90 VUs  1m07.0s/3m10.0s

running (1m08.0s), 90/90 VUs, 9331 complete and 0 interrupted iterations
ramp_load   [  36% ] 90/90 VUs  1m08.0s/3m10.0s

running (1m09.0s), 90/90 VUs, 9484 complete and 0 interrupted iterations
ramp_load   [  36% ] 90/90 VUs  1m09.0s/3m10.0s

running (1m10.0s), 90/90 VUs, 9630 complete and 0 interrupted iterations
ramp_load   [  37% ] 90/90 VUs  1m10.0s/3m10.0s

running (1m11.0s), 90/90 VUs, 9784 complete and 0 interrupted iterations
ramp_load   [  37% ] 90/90 VUs  1m11.0s/3m10.0s

running (1m12.0s), 90/90 VUs, 9941 complete and 0 interrupted iterations
ramp_load   [  38% ] 90/90 VUs  1m12.0s/3m10.0s

running (1m13.0s), 90/90 VUs, 10088 complete and 0 interrupted iterations
ramp_load   [  38% ] 90/90 VUs  1m13.0s/3m10.0s

running (1m14.0s), 90/90 VUs, 10246 complete and 0 interrupted iterations
ramp_load   [  39% ] 90/90 VUs  1m14.0s/3m10.0s

running (1m15.0s), 90/90 VUs, 10425 complete and 0 interrupted iterations
ramp_load   [  39% ] 90/90 VUs  1m15.0s/3m10.0s

running (1m16.0s), 90/90 VUs, 10547 complete and 0 interrupted iterations
ramp_load   [  40% ] 90/90 VUs  1m16.0s/3m10.0s

running (1m17.0s), 90/90 VUs, 10707 complete and 0 interrupted iterations
ramp_load   [  41% ] 90/90 VUs  1m17.0s/3m10.0s

running (1m18.0s), 90/90 VUs, 10866 complete and 0 interrupted iterations
ramp_load   [  41% ] 90/90 VUs  1m18.0s/3m10.0s

running (1m19.0s), 90/90 VUs, 11022 complete and 0 interrupted iterations
ramp_load   [  42% ] 90/90 VUs  1m19.0s/3m10.0s

running (1m20.0s), 90/90 VUs, 11188 complete and 0 interrupted iterations
ramp_load   [  42% ] 90/90 VUs  1m20.0s/3m10.0s

running (1m21.0s), 90/90 VUs, 11358 complete and 0 interrupted iterations
ramp_load   [  43% ] 90/90 VUs  1m21.0s/3m10.0s

running (1m22.0s), 90/90 VUs, 11464 complete and 0 interrupted iterations
ramp_load   [  43% ] 90/90 VUs  1m22.0s/3m10.0s

running (1m23.0s), 90/90 VUs, 11624 complete and 0 interrupted iterations
ramp_load   [  44% ] 90/90 VUs  1m23.0s/3m10.0s

running (1m24.0s), 90/90 VUs, 11790 complete and 0 interrupted iterations
ramp_load   [  44% ] 90/90 VUs  1m24.0s/3m10.0s

running (1m25.0s), 90/90 VUs, 11916 complete and 0 interrupted iterations
ramp_load   [  45% ] 90/90 VUs  1m25.0s/3m10.0s

running (1m26.0s), 90/90 VUs, 12060 complete and 0 interrupted iterations
ramp_load   [  45% ] 90/90 VUs  1m26.0s/3m10.0s

running (1m27.0s), 90/90 VUs, 12208 complete and 0 interrupted iterations
ramp_load   [  46% ] 90/90 VUs  1m27.0s/3m10.0s

running (1m28.0s), 90/90 VUs, 12326 complete and 0 interrupted iterations
ramp_load   [  46% ] 90/90 VUs  1m28.0s/3m10.0s

running (1m29.0s), 90/90 VUs, 12481 complete and 0 interrupted iterations
ramp_load   [  47% ] 90/90 VUs  1m29.0s/3m10.0s

running (1m30.0s), 90/90 VUs, 12653 complete and 0 interrupted iterations
ramp_load   [  47% ] 90/90 VUs  1m30.0s/3m10.0s

running (1m31.0s), 90/90 VUs, 12833 complete and 0 interrupted iterations
ramp_load   [  48% ] 90/90 VUs  1m31.0s/3m10.0s

running (1m32.0s), 90/90 VUs, 12975 complete and 0 interrupted iterations
ramp_load   [  48% ] 90/90 VUs  1m32.0s/3m10.0s

running (1m33.0s), 90/90 VUs, 13123 complete and 0 interrupted iterations
ramp_load   [  49% ] 90/90 VUs  1m33.0s/3m10.0s

running (1m34.0s), 90/90 VUs, 13277 complete and 0 interrupted iterations
ramp_load   [  49% ] 90/90 VUs  1m34.0s/3m10.0s

running (1m35.0s), 90/90 VUs, 13407 complete and 0 interrupted iterations
ramp_load   [  50% ] 90/90 VUs  1m35.0s/3m10.0s

running (1m36.0s), 90/90 VUs, 13546 complete and 0 interrupted iterations
ramp_load   [  51% ] 90/90 VUs  1m36.0s/3m10.0s

running (1m37.0s), 90/90 VUs, 13713 complete and 0 interrupted iterations
ramp_load   [  51% ] 90/90 VUs  1m37.0s/3m10.0s

running (1m38.0s), 90/90 VUs, 13893 complete and 0 interrupted iterations
ramp_load   [  52% ] 90/90 VUs  1m38.0s/3m10.0s

running (1m39.0s), 90/90 VUs, 14063 complete and 0 interrupted iterations
ramp_load   [  52% ] 90/90 VUs  1m39.0s/3m10.0s

running (1m40.0s), 90/90 VUs, 14192 complete and 0 interrupted iterations
ramp_load   [  53% ] 90/90 VUs  1m40.0s/3m10.0s

running (1m41.0s), 90/90 VUs, 14334 complete and 0 interrupted iterations
ramp_load   [  53% ] 90/90 VUs  1m41.0s/3m10.0s

running (1m42.0s), 90/90 VUs, 14481 complete and 0 interrupted iterations
ramp_load   [  54% ] 90/90 VUs  1m42.0s/3m10.0s

running (1m43.0s), 90/90 VUs, 14639 complete and 0 interrupted iterations
ramp_load   [  54% ] 90/90 VUs  1m43.0s/3m10.0s

running (1m44.0s), 90/90 VUs, 14795 complete and 0 interrupted iterations
ramp_load   [  55% ] 90/90 VUs  1m44.0s/3m10.0s

running (1m45.0s), 90/90 VUs, 14951 complete and 0 interrupted iterations
ramp_load   [  55% ] 90/90 VUs  1m45.0s/3m10.0s

running (1m46.0s), 90/90 VUs, 15108 complete and 0 interrupted iterations
ramp_load   [  56% ] 90/90 VUs  1m46.0s/3m10.0s

running (1m47.0s), 90/90 VUs, 15258 complete and 0 interrupted iterations
ramp_load   [  56% ] 90/90 VUs  1m47.0s/3m10.0s

running (1m48.0s), 90/90 VUs, 15393 complete and 0 interrupted iterations
ramp_load   [  57% ] 90/90 VUs  1m48.0s/3m10.0s

running (1m49.0s), 90/90 VUs, 15498 complete and 0 interrupted iterations
ramp_load   [  57% ] 90/90 VUs  1m49.0s/3m10.0s

running (1m50.0s), 90/90 VUs, 15623 complete and 0 interrupted iterations
ramp_load   [  58% ] 90/90 VUs  1m50.0s/3m10.0s

running (1m51.0s), 90/90 VUs, 15721 complete and 0 interrupted iterations
ramp_load   [  58% ] 90/90 VUs  1m51.0s/3m10.0s

running (1m52.0s), 90/90 VUs, 15820 complete and 0 interrupted iterations
ramp_load   [  59% ] 90/90 VUs  1m52.0s/3m10.0s

running (1m53.0s), 90/90 VUs, 15924 complete and 0 interrupted iterations
ramp_load   [  59% ] 90/90 VUs  1m53.0s/3m10.0s

running (1m54.0s), 90/90 VUs, 16026 complete and 0 interrupted iterations
ramp_load   [  60% ] 90/90 VUs  1m54.0s/3m10.0s

running (1m55.0s), 90/90 VUs, 16148 complete and 0 interrupted iterations
ramp_load   [  61% ] 90/90 VUs  1m55.0s/3m10.0s

running (1m56.0s), 90/90 VUs, 16256 complete and 0 interrupted iterations
ramp_load   [  61% ] 90/90 VUs  1m56.0s/3m10.0s

running (1m57.0s), 90/90 VUs, 16354 complete and 0 interrupted iterations
ramp_load   [  62% ] 90/90 VUs  1m57.0s/3m10.0s

running (1m58.0s), 90/90 VUs, 16481 complete and 0 interrupted iterations
ramp_load   [  62% ] 90/90 VUs  1m58.0s/3m10.0s

running (1m59.0s), 90/90 VUs, 16578 complete and 0 interrupted iterations
ramp_load   [  63% ] 90/90 VUs  1m59.0s/3m10.0s

running (2m00.0s), 90/90 VUs, 16668 complete and 0 interrupted iterations
ramp_load   [  63% ] 90/90 VUs  2m00.0s/3m10.0s

running (2m01.0s), 90/90 VUs, 16764 complete and 0 interrupted iterations
ramp_load   [  64% ] 90/90 VUs  2m01.0s/3m10.0s

running (2m02.0s), 90/90 VUs, 16897 complete and 0 interrupted iterations
ramp_load   [  64% ] 90/90 VUs  2m02.0s/3m10.0s

running (2m03.0s), 90/90 VUs, 17022 complete and 0 interrupted iterations
ramp_load   [  65% ] 90/90 VUs  2m03.0s/3m10.0s

running (2m04.0s), 90/90 VUs, 17189 complete and 0 interrupted iterations
ramp_load   [  65% ] 90/90 VUs  2m04.0s/3m10.0s

running (2m05.0s), 90/90 VUs, 17365 complete and 0 interrupted iterations
ramp_load   [  66% ] 90/90 VUs  2m05.0s/3m10.0s

running (2m06.0s), 90/90 VUs, 17541 complete and 0 interrupted iterations
ramp_load   [  66% ] 90/90 VUs  2m06.0s/3m10.0s

running (2m07.0s), 90/90 VUs, 17694 complete and 0 interrupted iterations
ramp_load   [  67% ] 90/90 VUs  2m07.0s/3m10.0s

running (2m08.0s), 90/90 VUs, 17841 complete and 0 interrupted iterations
ramp_load   [  67% ] 90/90 VUs  2m08.0s/3m10.0s

running (2m09.0s), 90/90 VUs, 18003 complete and 0 interrupted iterations
ramp_load   [  68% ] 90/90 VUs  2m09.0s/3m10.0s

running (2m10.0s), 90/90 VUs, 18160 complete and 0 interrupted iterations
ramp_load   [  68% ] 90/90 VUs  2m10.0s/3m10.0s

running (2m11.0s), 90/90 VUs, 18325 complete and 0 interrupted iterations
ramp_load   [  69% ] 90/90 VUs  2m11.0s/3m10.0s

running (2m12.0s), 90/90 VUs, 18468 complete and 0 interrupted iterations
ramp_load   [  69% ] 90/90 VUs  2m12.0s/3m10.0s

running (2m13.0s), 90/90 VUs, 18628 complete and 0 interrupted iterations
ramp_load   [  70% ] 90/90 VUs  2m13.0s/3m10.0s

running (2m14.0s), 90/90 VUs, 18789 complete and 0 interrupted iterations
ramp_load   [  71% ] 90/90 VUs  2m14.0s/3m10.0s

running (2m15.0s), 90/90 VUs, 18922 complete and 0 interrupted iterations
ramp_load   [  71% ] 90/90 VUs  2m15.0s/3m10.0s

running (2m16.0s), 90/90 VUs, 19015 complete and 0 interrupted iterations
ramp_load   [  72% ] 90/90 VUs  2m16.0s/3m10.0s

running (2m17.0s), 90/90 VUs, 19129 complete and 0 interrupted iterations
ramp_load   [  72% ] 90/90 VUs  2m17.0s/3m10.0s

running (2m18.0s), 90/90 VUs, 19280 complete and 0 interrupted iterations
ramp_load   [  73% ] 90/90 VUs  2m18.0s/3m10.0s

running (2m19.0s), 90/90 VUs, 19451 complete and 0 interrupted iterations
ramp_load   [  73% ] 90/90 VUs  2m19.0s/3m10.0s

running (2m20.0s), 90/90 VUs, 19642 complete and 0 interrupted iterations
ramp_load   [  74% ] 90/90 VUs  2m20.0s/3m10.0s

running (2m21.0s), 90/90 VUs, 19775 complete and 0 interrupted iterations
ramp_load   [  74% ] 90/90 VUs  2m21.0s/3m10.0s

running (2m22.0s), 90/90 VUs, 19917 complete and 0 interrupted iterations
ramp_load   [  75% ] 90/90 VUs  2m22.0s/3m10.0s

running (2m23.0s), 90/90 VUs, 20071 complete and 0 interrupted iterations
ramp_load   [  75% ] 90/90 VUs  2m23.0s/3m10.0s

running (2m24.0s), 90/90 VUs, 20214 complete and 0 interrupted iterations
ramp_load   [  76% ] 90/90 VUs  2m24.0s/3m10.0s

running (2m25.0s), 90/90 VUs, 20355 complete and 0 interrupted iterations
ramp_load   [  76% ] 90/90 VUs  2m25.0s/3m10.0s

running (2m26.0s), 90/90 VUs, 20518 complete and 0 interrupted iterations
ramp_load   [  77% ] 90/90 VUs  2m26.0s/3m10.0s

running (2m27.0s), 90/90 VUs, 20692 complete and 0 interrupted iterations
ramp_load   [  77% ] 90/90 VUs  2m27.0s/3m10.0s

running (2m28.0s), 90/90 VUs, 20841 complete and 0 interrupted iterations
ramp_load   [  78% ] 90/90 VUs  2m28.0s/3m10.0s

running (2m29.0s), 90/90 VUs, 20997 complete and 0 interrupted iterations
ramp_load   [  78% ] 90/90 VUs  2m29.0s/3m10.0s

running (2m30.0s), 90/90 VUs, 21123 complete and 0 interrupted iterations
ramp_load   [  79% ] 90/90 VUs  2m30.0s/3m10.0s

running (2m31.0s), 90/90 VUs, 21287 complete and 0 interrupted iterations
ramp_load   [  79% ] 90/90 VUs  2m31.0s/3m10.0s

running (2m32.0s), 90/90 VUs, 21457 complete and 0 interrupted iterations
ramp_load   [  80% ] 90/90 VUs  2m32.0s/3m10.0s

running (2m33.0s), 90/90 VUs, 21642 complete and 0 interrupted iterations
ramp_load   [  81% ] 90/90 VUs  2m33.0s/3m10.0s

running (2m34.0s), 90/90 VUs, 21803 complete and 0 interrupted iterations
ramp_load   [  81% ] 90/90 VUs  2m34.0s/3m10.0s

running (2m35.0s), 90/90 VUs, 21962 complete and 0 interrupted iterations
ramp_load   [  82% ] 90/90 VUs  2m35.0s/3m10.0s

running (2m36.0s), 90/90 VUs, 22099 complete and 0 interrupted iterations
ramp_load   [  82% ] 90/90 VUs  2m36.0s/3m10.0s

running (2m37.0s), 90/90 VUs, 22252 complete and 0 interrupted iterations
ramp_load   [  83% ] 90/90 VUs  2m37.0s/3m10.0s

running (2m38.0s), 90/90 VUs, 22417 complete and 0 interrupted iterations
ramp_load   [  83% ] 90/90 VUs  2m38.0s/3m10.0s

running (2m39.0s), 90/90 VUs, 22562 complete and 0 interrupted iterations
ramp_load   [  84% ] 90/90 VUs  2m39.0s/3m10.0s

running (2m40.0s), 90/90 VUs, 22732 complete and 0 interrupted iterations
ramp_load   [  84% ] 90/90 VUs  2m40.0s/3m10.0s

running (2m41.0s), 89/90 VUs, 22872 complete and 0 interrupted iterations
ramp_load   [  85% ] 89/90 VUs  2m41.0s/3m10.0s

running (2m42.0s), 85/90 VUs, 23021 complete and 0 interrupted iterations
ramp_load   [  85% ] 85/90 VUs  2m42.0s/3m10.0s

running (2m43.0s), 82/90 VUs, 23160 complete and 0 interrupted iterations
ramp_load   [  86% ] 82/90 VUs  2m43.0s/3m10.0s

running (2m44.0s), 79/90 VUs, 23304 complete and 0 interrupted iterations
ramp_load   [  86% ] 79/90 VUs  2m44.0s/3m10.0s

running (2m45.0s), 76/90 VUs, 23447 complete and 0 interrupted iterations
ramp_load   [  87% ] 76/90 VUs  2m45.0s/3m10.0s

running (2m46.0s), 73/90 VUs, 23605 complete and 0 interrupted iterations
ramp_load   [  87% ] 73/90 VUs  2m46.0s/3m10.0s

running (2m47.0s), 71/90 VUs, 23776 complete and 0 interrupted iterations
ramp_load   [  88% ] 71/90 VUs  2m47.0s/3m10.0s

running (2m48.0s), 67/90 VUs, 23930 complete and 0 interrupted iterations
ramp_load   [  88% ] 67/90 VUs  2m48.0s/3m10.0s

running (2m49.0s), 64/90 VUs, 24093 complete and 0 interrupted iterations
ramp_load   [  89% ] 64/90 VUs  2m49.0s/3m10.0s

running (2m50.0s), 61/90 VUs, 24255 complete and 0 interrupted iterations
ramp_load   [  89% ] 61/90 VUs  2m50.0s/3m10.0s

running (2m51.0s), 59/90 VUs, 24413 complete and 0 interrupted iterations
ramp_load   [  90% ] 59/90 VUs  2m51.0s/3m10.0s

running (2m52.0s), 55/90 VUs, 24571 complete and 0 interrupted iterations
ramp_load   [  91% ] 55/90 VUs  2m52.0s/3m10.0s

running (2m53.0s), 52/90 VUs, 24715 complete and 0 interrupted iterations
ramp_load   [  91% ] 52/90 VUs  2m53.0s/3m10.0s

running (2m54.0s), 49/90 VUs, 24875 complete and 0 interrupted iterations
ramp_load   [  92% ] 49/90 VUs  2m54.0s/3m10.0s

running (2m55.0s), 46/90 VUs, 25046 complete and 0 interrupted iterations
ramp_load   [  92% ] 46/90 VUs  2m55.0s/3m10.0s

running (2m56.0s), 43/90 VUs, 25210 complete and 0 interrupted iterations
ramp_load   [  93% ] 43/90 VUs  2m56.0s/3m10.0s

running (2m57.0s), 40/90 VUs, 25373 complete and 0 interrupted iterations
ramp_load   [  93% ] 40/90 VUs  2m57.0s/3m10.0s

running (2m58.0s), 37/90 VUs, 25513 complete and 0 interrupted iterations
ramp_load   [  94% ] 37/90 VUs  2m58.0s/3m10.0s

running (2m59.0s), 34/90 VUs, 25654 complete and 0 interrupted iterations
ramp_load   [  94% ] 34/90 VUs  2m59.0s/3m10.0s

running (3m00.0s), 31/90 VUs, 25809 complete and 0 interrupted iterations
ramp_load   [  95% ] 31/90 VUs  3m00.0s/3m10.0s

running (3m01.0s), 28/90 VUs, 25967 complete and 0 interrupted iterations
ramp_load   [  95% ] 28/90 VUs  3m01.0s/3m10.0s

running (3m02.0s), 25/90 VUs, 26129 complete and 0 interrupted iterations
ramp_load   [  96% ] 25/90 VUs  3m02.0s/3m10.0s

running (3m03.0s), 22/90 VUs, 26282 complete and 0 interrupted iterations
ramp_load   [  96% ] 22/90 VUs  3m03.0s/3m10.0s

running (3m04.0s), 19/90 VUs, 26426 complete and 0 interrupted iterations
ramp_load   [  97% ] 19/90 VUs  3m04.0s/3m10.0s

running (3m05.0s), 16/90 VUs, 26556 complete and 0 interrupted iterations
ramp_load   [  97% ] 16/90 VUs  3m05.0s/3m10.0s

running (3m06.0s), 13/90 VUs, 26664 complete and 0 interrupted iterations
ramp_load   [  98% ] 13/90 VUs  3m06.0s/3m10.0s

running (3m07.0s), 10/90 VUs, 26756 complete and 0 interrupted iterations
ramp_load   [  98% ] 10/90 VUs  3m07.0s/3m10.0s

running (3m08.0s), 07/90 VUs, 26826 complete and 0 interrupted iterations
ramp_load   [  99% ] 07/90 VUs  3m08.0s/3m10.0s

running (3m09.0s), 04/90 VUs, 26871 complete and 0 interrupted iterations
ramp_load   [  99% ] 04/90 VUs  3m09.0s/3m10.0s

running (3m10.0s), 01/90 VUs, 26892 complete and 0 interrupted iterations
ramp_load   [ 100% ] 01/90 VUs  3m10.0s/3m10.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1500' p(95)=688.98ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 53788   282.944675/s
    checks_succeeded...: 100.00% 53788 out of 53788
    checks_failed......: 0.00%   0 out of 53788

    ✓ status 200
    ✓ response is array or object

    HTTP
    http_req_duration..............: avg=388.63ms min=3.07ms   med=416.84ms max=1.49s p(90)=579.23ms p(95)=688.98ms
      { expected_response:true }...: avg=388.63ms min=3.07ms   med=416.84ms max=1.49s p(90)=579.23ms p(95)=688.98ms
    http_req_failed................: 0.00%  0 out of 26894
    http_reqs......................: 26894  141.472337/s

    EXECUTION
    iteration_duration.............: avg=525.71ms min=111.68ms med=551.57ms max=1.62s p(90)=726.95ms p(95)=836.63ms
    iterations.....................: 26894  141.472337/s
    vus............................: 1      min=1          max=90
    vus_max........................: 90     min=90         max=90

    NETWORK
    data_received..................: 2.9 GB 15 MB/s
    data_sent......................: 2.2 MB 12 kB/s



running (3m10.1s), 00/90 VUs, 26894 complete and 0 interrupted iterations
ramp_load ✓ [ 100% ] 00/90 VUs  3m10s